# Pokemon

### Introduction:

This time you will create the data.



### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create a data dictionary that looks like the DataFrame below

In [2]:
data = pd.DataFrame({'evolution':['Ivysaur','Charmeleon','Wartortle','Metapod'],
                     'hp':[45,39,44,45],
                    'name':['Bulbasaur','Charmander','Squirtle','Caterpie'],
                    'pokedex':['yes','no','yes','no'],
                    'type':['grass','fire','water','bug']})

### Step 3. Assign it to a variable called pokemon

In [8]:
pokemon=data.copy()
pokemon

    evolution  hp        name pokedex   type
0     Ivysaur  45   Bulbasaur     yes  grass
1  Charmeleon  39  Charmander      no   fire
2   Wartortle  44    Squirtle     yes  water
3     Metapod  45    Caterpie      no    bug

### Step 4. Ops...it seems the DataFrame columns are in alphabetical order. Place  the order of the columns as name, type, hp, evolution, pokedex

In [9]:
pokemon.reindex(columns=['name','type','hp','evolution','pokedex'])

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

### Step 5. Add another column called place, and insert what you have in mind.

In [10]:
pokemon['place']=['Pune','Mumbai','Nashik','Jalgaon']

In [11]:
pokemon

    evolution  hp        name pokedex   type    place
0     Ivysaur  45   Bulbasaur     yes  grass     Pune
1  Charmeleon  39  Charmander      no   fire   Mumbai
2   Wartortle  44    Squirtle     yes  water   Nashik
3     Metapod  45    Caterpie      no    bug  Jalgaon

### Step 6. Present the type of each column

In [12]:
pokemon.dtypes

evolution    object
hp            int64
name         object
pokedex      object
type         object
place        object
dtype: object

### BONUS: Create your own question and answer it.

In [18]:
pokemon.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   evolution  4 non-null      object
 1   hp         4 non-null      int64
 2   name       4 non-null      object
 3   pokedex    4 non-null      object
 4   type       4 non-null      object
 5   place      4 non-null      object
dtypes: int64(1), object(5)
memory usage: 320.0+ bytes

In [21]:
pokemon.describe()

              hp
count   4.000000
mean   43.250000
std     2.872281
min    39.000000
25%    42.750000
50%    44.500000
75%    45.000000
max    45.000000

In [25]:
by_type=pokemon.groupby("type")
by_type

In [27]:
by_type.describe()

         hp
      count  mean std   min   25%   50%   75%   max
type
bug     1.0  45.0 NaN  45.0  45.0  45.0  45.0  45.0
fire    1.0  39.0 NaN  39.0  39.0  39.0  39.0  39.0
grass   1.0  45.0 NaN  45.0  45.0  45.0  45.0  45.0
water   1.0  44.0 NaN  44.0  44.0  44.0  44.0  44.0

In [28]:
pokemon

    evolution  hp        name pokedex   type    place
0     Ivysaur  45   Bulbasaur     yes  grass     Pune
1  Charmeleon  39  Charmander      no   fire   Mumbai
2   Wartortle  44    Squirtle     yes  water   Nashik
3     Metapod  45    Caterpie      no    bug  Jalgaon

#### Find Out name of pockemon having pokedox 'yes'

In [34]:
pokemon[pokemon['pokedex']=='yes']['name']

0    Bulbasaur
2     Squirtle
Name: name, dtype: object